In [1]:
# DBMS : 데이터베이스 매니지먼트 시스템(데이터베이스를 관리하는 미들웨어 시스템)
# RDBMS : 구조설계가 필요한 데이터베이스(스키마) -- oracle, mysql, postgresql, sqlite
# NoSQL : 많은 데이터 저장이 가능, 데이터간의 관계가 없으므로 무조건 다 저장해야됨, 복잡성이 작음, 빠름 -- Mongodb

In [ ]:
# 일단 MySQL, Mongobd 배운다. Redis는 아주 빠르므로 나중에 배운다.

In [ ]:
# MySQL은 데이터베이스 서버이다.
# 다중사용자와 다중 스레드 지원
# 표준SQL을 사용함(문법이 스탬다드임)
# 세계적으로 많이 사용
# 가격저렴하고 강력한 기능

# 새로운걸 만들어 넣는경우 관계를 정리하다가 꼬일수가 있다.
# 스키마 수정이 어렵다는 단점이 있다.

# table : row와 colunm(field)로 이루어져있는 데이터베이스를 이루는 기본 단위
# 저장엔진 : MylSAM, innoDB
# column : 테이블의 세로축 데이터
# row : 가로축 데이터

In [2]:
# 트렌젝션이란? : 중복확인요청시 문제발생을 막기위해 실행단위(프로시저)를 묶어서 관리하는것.
# RDBMS : value, key, relationship, 스키마 (데이터베이스 설계)

In [4]:
# NoSQL == RDBMS의 한계를 극복하기 위해 만들어짐
# --> Not only SQL
# 확장성이 용이하고, 데이터 저장이 유연함, 스키마나 join이 없다.
# collection별롸 관계가 없기때문에 모든 데이터가 들어있어야 한다.
# json포멧(key-value형태)을 사용
# insert가 빨라서 데이터베이스에 많이 사용됨(단 select는 느림..)
# 트랜젝션이 지원되지 않음.(동시수정에 대한 신뢰성이 지원되지 않음)
# Mongodb를 사용할거임~

In [ ]:
# install 하는 방법

# reference 참조
# - https://www.cyberciti.biz/faq/howto-install-mysql-on-ubuntu-linux-16-04/


# 1.1 install

# # apt 업데이트 및 업그레이드
# $ sudo apt update
# $ sudo apt upgrade

# # mysql-server, mysql-client 설치 ( 설치 중간에 패스워드 입력 )
# $ sudo apt install mysql-server mysql-client

# 1.2 mysql secure 설정

# # mysql 보안 관련 설정 ( n-n-y-n-y-y 순으로 입력해줍니다. )
# $ sudo mysql_secure_installation

# # mysql root 사용자로 접속
# $ mysql -u root -p





# 3. 외부접속 설정---------------------------------------------

# # mysql 설정파일 bind-address = 0.0.0.0 으로 수정
# $ sudo vi /etc/mysql/mysql.conf.d/mysqld.cnf
# bind-address = 0.0.0.0

# # 외부접속이 허용되도록 mysql 설정
# mysql> grant all privileges on *.* to root@'%' identified by '<password>';

# 3

# # 비밀번호가 qwer1234 인경우 아래와 같이 입력
# mysql> grant all privileges on *.* to root@'%' identified by 'qwer1234';

# 기본문법 (테이블/DB 생성, 확인 등)

In [1]:
# query 문 학습--------------------------------------------------------------

# status 현재상태

# 데이터베이스 생성/선택/삭제 ---------------------

# create database test;
# use test; # 데이터베이스 선택
# select database(); #현재 선택된 데이터베이스 확인

# drop database test;# 데이터베이스 삭제

# 테이블 생성/선택/삭제 --------------------------

# create table user(
    # name char(20),
    # age int(3));
# show tables;
# desc user;

# rename table user to dss; # 테이블 명 변경
# drop table dss; # 데이블 삭제

# 열삽입 (테이블 이름이 dss인 경우 기준)
# insert into dss(name,age)
    # values("alice",30),
    # (peter, 22);
    
# 열 확인
# select * from dss

In [ ]:
# 데이터베이스 sql파일 다운로드 하는곳
# - https://dev.mysql.com/doc/index-other.html


# 일단 sql을 넣기전에 데이터베이스의 베이스는 미리 만들어져있어야한다.

# 밖에서 바로 데이터베이스 넣기
# mysql -u root -p world < world.sql

# mysql에서 넣기
# mysql> source world.sql

# 기초문법~

In [ ]:
# 이거슨 테이블에 필드의 설정을 넣어주는 방법
# create table user2 (
# user_id int primary key auto_increment,
# name varchar(20) not null,
# email varchar(30) unique not null,
# age int(3) DEFAULT 30,
# rdate timestamp
# )


# 일단 (https://drive.google.com/drive/folders/1lx1ugXGKjiYcTZ5FynmQgPL8FM_WAD9v) 여기서 내용 확인 ~!


# create
# alter  <--- 뭔가 수정할때 사용
# database
# table(column) - add, modify, drop


# create table tmp(id int);
# drop table tmp;


# ALTER TABLE user2 DROP tmp;
# ALTER TABLE user2 ADD tmp TEXT;
# ALTER TABLE user2 MODIFY COLUMN tmp INT(3);


# 데이터의 형찾기 및 변환 

# show variables like 'character_set_database';
# ALTER DATABASE test CHARACTER SET = utf8;
# ALTER DATABASE test CHARACTER SET = ascii;


# insert-----------------------------
# INSERT INTO user1(user_id, name, email, age, rdate)
# VALUES (1, "jin", "pdj@gmail.com", 30, now()),
# (2, "peter", "peter@daum.net", 33, '2017-02-20'),
# (3, "alice", "alice@naver.com", 23, '2018-01-05'),
# (4, "po", "po@gmail.com", 43, '2002-09-16'),
# (5, "andy", "andy@gmail.com", 17, '2016-04-28'),
# (6, "jin", "jin1224@gmail.com", 33, '2013-09-02');

# INSERT INTO user2(name, email)
# VALUES ("jin", "pdj@gmail.com"),
# ("jun", "jin1224@gmail.com");

#### 여기서부턴 select 아래로 다 포함되는 명령어들임 ㅋㅋㅋㅋ--------------------------------------
# select ------★★★★ 데이터를 가져오는 기본적인 syntax----------- 
# select * from user1
# select name, email from user1
# select name as "이름", email as "이메일" from user1 --- 출력되는 컬럼이름을 바꿀수 있음(실제는 바뀌지 않음)

    # distinct 중복제거--------
    # select distinct(name) from user1; --- 중복제거

    # where 조건으로 찾기---------
    # select *
    # from user1
    # where rdate > "2017-01-01" and rdate < "2018-07-01"; 

    # --> where rdate between "2017-01-01" and "2018-07-01"; 날짜데이터에서는 between을 사용하여 써도 된다. 


    # order by (asc,desc) 오름차순 내림차순 ---------
    # SELECT *
    # FROM user1
    # ORDER BY age DESC, rdate DESC


    # concat (출력되는 방식 결정)----------
    # SELECT name, age, concat(name, "(" , age, ")")
    # from user1



    # like , not like (문자열 내의 내용을 기준으로 조건 찾기)------
    # select *
    # from user1
    # where email like "%@gmail%"; # 다만 like는 오래걸릴 수 있다. 따라서 다른 insert라는걸 배운다
    
    # --> where email not like "%@gmail%";
    
    # in -----------------------
    # select *
    # from user1
    # where name = "andy" or name = "jin" or name = "alice" <--- or 남발하는건 비효율적임
    # ---> where name in ("andy", "jin", "alice") <--- 이렇게 쓰자
    
    # limit -----너무 많은 데이터를 찾느라 오래걸리는경우 리미트를 걸어줌----
    # select *
    # from user1
    # limit 3 <-- 3개만 검색
    # limit 2,4 <-- 2부터 4개까지 검색
    
# 자.... 여기부터는 실제로 DB의 내용을 수정하는 내용이다. 운전한다고 생각하고 항상 안전운전 하는 습관을...
    
# update -- 주의... 꼭 먼저 조건맞춰서 바뀔내용을 찾아보고 조금씩 변경해본후 적용해라--------
# update user1
# set age=20, email="bright@daum.net"
# where name="peter"
# limit 100 # 이걸로 조심조심 해본다

# 아래처럼 위와 조건 맞춰서 이 쿼리문이 맞는지 확인부터...
# select *
# from user1
# where name="peter";


# delete --- 주의... 진짜 주의해야할것이다.-----
# delete from user1
# where rdate < "2016-01-01"

# 아래처럼 먼저 찾아보고...
# select * from user1
# where rdate < "2016-01-01"


# ★★★★★
# gruop by --- count, min, max,sum,avg... 수식계산 가능~!!!!

# 1. count 카운트함수 - 각 나라별로 몇개의 도시가 있는지 출력해보기
    # select CountryCode, count(CountryCode)
    # from city
    # group by CountryCode

    # 활용 - 전체도시의 갯수 세기(중복제거하고)
    # select count(DISTINCT(CountryCode))
    # from city
    
# 2. min - 대륙별로 인구수화 GNP최소값을 조회
    # select continent, min(GNP), min(Population)ㅠ
    # from country
    # where GNP != 0 and Population != 0
    # group by continent

# 3. max - 대륙별로 인구수화 GNP최대값을 조회
    # select continent, max(GNP), max(Population)
    # from country
    # where GNP != 0 and Population != 0
    # group by continent

# 4. avg - 대륙별로 총 인구수와 총 GNP의 평균
    # select continent, avg(GNP), avg(Population) as Population
    # from country
    # where GNP != 0 and Population != 0
    # group by continent
    # order by Population

# 5. having - 값을 가지고 있는 경우
    # 먼저 아래의 경우는 우리가 원하는 결과 데이터가 아니라 처음 계산시에 조건이 적용되어버려서
    # 5억명 이상의 데이터만 계산된다 ㅜㅜ
    # select Continent, sum(Population) as Population
    # from country
    # where Population > 500000000 # 데이터 계산 전에 조건을 적용.....
    # group by Continent           # 망.....
    
    # having을 사용하여 아래처럼 쓰면 결과 데이터를 조건으로 검색한다.
    # select Continent, sum(Population) as Population
    # from country
    # group by Continent
    # having Population > 500000000

# 실전문법

In [ ]:
# 올림, 반올림, 내림
# 조건문 : if when than else
# 날짜데이터 포멧팅 : gruop by(일별데이터, 뭘별데이터)
# 조인(Join).... inner join, left join, right join, full outer 적으면 재밌고 많으면 ㅈ되고...
# 유니온(union) - 두개의 결과 합치기 명령
# sub-query - select절, from절, where절에 들어가는 sql구문
# index - sql쿼리를 빠르게 수행할 수 있도록 하는 방법
# view - 복잡하지만 자주 사용되는 sql구문을 임시로 만드는테이블입니다.



# ceil, round, truncate 올림/반올림/버림----------------------------
    # select ceil(12.34) # --> 13 # ceil의 문제는 자릿수 지정이 안된다는것임. 그래서 아래같이 쓴다.
    # select ceil(12.34*10)*0.1 -->  12.4

    # select round(12.345, 1) # --> 12.3

    # select truncate(12.345, 2) # --> 12.34 (잘라내기)


# if ----------------
    # select name, population, if(population >1000000, "big city","small city") as city_scale from city
    # having city_scale = "big city" 

    # null값 0으로 바꿔서 출력하기
    # select indepyear, ifnull(indepyear,0) from country
    # limit 5


# case when then ----------------
    # 나라별 인구가 10억이상, 10억~1억, 1억이하에 big mid sml  출력
    # select name, population,
    # case
    #     when population > 1000000000 then "Big"
    #     when population > 100000000 then "Mid"
    #     else "Sml"
    # end as scale
    # from country
    # having = scale = "Mid"
    # order by population desc;


# date format ---------------------
    # https://dev.mysql.com/doc/refman/5.7/en/date-and-time-functions.html

    # 연월일 데이터를 연,월만 보고자 할 경우
    # select amount, payment_date, date_format(payment_date, "%Y-%m") as monthly from payment

    # 응용 group by - sum
    # select date_format(payment_date, "%Y-%m") as monthly, sum(amount) as total
    # from payment
    # group by monthly;


# Join 데이터 테이블 결합------------------------
# 종류 : inner, left, right

# 기본적으로는 inner join이 된다
    # on의 조건이 없는경우엔 전체가 매핑된다.(양이 많아짐)
    # select *
    # from user
    # join addr
    # on user.user_id = addr.user_id

    # select user.name, addr.addr
    # from user
    # join addr
    # on user.user_id = addr.user_id

    #left/right join----
    # select user.name, addr.addr
    # from user
    # left join addr
    # on user.user_id = addr.user_id

    # select user.name, addr.addr
    # from user
    # right join addr
    # on user.user_id = addr.user_id
    
    
    # join은 데이터가 많은 데이터들을 적용할려고하면 느려진다. 작은 데이터간의 join을 하는걸 추천
    # 큰거는 그대로 쓰는게좋을수도.

# Union-----------------------------------------------
    # select name
    # from user
    # union all # <-- (all을 할 경우 중복이 허용되고 all이 없으면 중복허용이 안됨)
    # select addr
    # from addr
    
# join된 두 쿼리를 Union으로 중복제거하면서 합쳐보자    
    # select user.name, addr.addr
    # from user
    # left join addr
    # on user.user_id = addr.user_id
    # union #<---- 여기에 쓴다
    # select user.name, addr.addr
    # from user
    # right join addr
    # on user.user_id = addr.user_id
    
# sub-query : select, from where 활용하기---------------------
# 전체나라수, 전체 도시수, 전체 언어수
    # select
    # (select count(*) from country) as total_country,
    # (select count(*) from city) as total_city,
    # (select count(DISTINCT(language)) from countrylanguage) as total_language;

# 800만 이상이 되는 도시의 국가코드, 이름 ,도시인구수를 출력
    # select city.countrycode, city.name, country.Name, city.population
    # from (
    # select countrycode, name, population
    # from city
    # where population > 8000000
    # ) as city # 이걸 쓰면 이제 여기 쿼리에서는 city가 from에 있는 요소로만 사용이 바뀐다.
    # join country
    # on city.countrycode = country.code
    
# 800만 이상 도시의 국가코드, 국가이름, 대통령 이름을 출력
    # select code, name, headofstate
    # from country
    # where code in (
    #   select countrycode from city where population > 8000000
    # )

# explain -- 다음에 쓰는 쿼리문의 실행계획을 보여준다.----------------------

# index ---- 새로운 index를 만들어서 속도개선(단 용량을 차지하게되고, index가 많아지면 속도가 떨어짐ㅜ)
    # index 만들기
    # create index salaries
    # on salaries(salary)
    
    # 실행해보자
    # select *
    # from salaries
    # where salary > 60000
    # limit 100000  # <-- 이런 조건이 있어야 index를 사용한 찾기가 실행된다. 매우 빨라지는걸 볼 수 있다.

    # index 삭제하기
    # drop index salaries
    # on salaries(salary)
    
    # 조건문에서 자주 쓰이는 컬럼들을 index화 하는게 좋다. select가 빨라진다는 장점이 있다.
    # 다만 너무 많은 index는 느려지게 하므로 몇몇 필요한컬럼만 index를 만드는게 좋다.
    
# view -- 모아서 보여주는 형태, 자주 쓰이는 형태의 결과물을 미리 만들어두어 테이블처럼 사용할 수 있게함
    # create view country_city as 
    # select countrycode, country.name as country_name, city.name as city_name 
    # from country
    # join city
    # on country.code = city.countrycode;
    
    
# group by name --> group_concat(language)  --> 그룹바이가 name으로된 경우 그 값중 language를 한줄로 표시함

# 파이썬에 db를 연결하자

In [1]:
import MySQLdb

In [26]:
from sqlalchemy import create_engine

In [36]:
# 비밀번호를 직접 입력해서 하자. github에 뿌려지기 무섭다.
import getpass

pw = getpass.getpass('Password:')
# pw = str(input("input your password : "))

Password:········

In [38]:
db = MySQLdb.connect(
    '13.209.5.42', #ip
    'root',#user
    pw,#pw
    'city_info',#database (option)
    charset = "utf8"
)

In [39]:
curs = db.cursor()

In [40]:
QUERY1 = """
    SELECT *
    FROM popular
"""

In [41]:
count = curs.execute(QUERY1)
count

5

In [42]:
rows = curs.fetchall()
rows

((1, 'seoul', 9904312),
 (2, 'busan', 3448737),
 (3, 'amude', 1000000),
 (6, 'gwanggju', 1502881),
 (6, 'gwanggju', 1502881))

In [43]:
# 이미 한번 가져오면 끝나기때문에 또 불러와도 데이터가 비어있다.
curs.fetchall()

()

##### insert - (update와 delete : 쿼리만 좀 바꿔주면 할 수 있음~!)

In [44]:
QUERY2 = """
    INSERT INTO popular(rank, city_name, popular)
    VALUES(6, "gwanggju", 1502881)
"""

In [45]:
# curs = db.cursor()
count = curs.execute(QUERY2)
count

1

In [46]:
# 서버 데이터베이스에 반영함
db.commit()

In [47]:
# db연결종료
db.close()

### pandas로 가져오기
    - database --> dataframe

In [20]:
# 일단 db연결
db = MySQLdb.connect(
    '13.209.5.42', #ip
    'root',#user
    pw,#pw
    'city_info',#database (option)
    charset = "utf8"
)

QUERY1 = """
    SELECT *
    FROM popular
"""

In [21]:
city_df = pd.read_sql(QUERY1, db)
city_df

   rank city_name  popular
0     1     seoul  9904312
1     2     busan  3448737
2     3     amude  1000000
3     6  gwanggju  1502881
4     6  gwanggju  1502881

### pandas 에서 db로 보내기
- dataframe --> database

In [30]:
import seaborn as sns # 데이터 넣어볼라고 가져오는거임~
tips = sns.load_dataset("tips")
# tips.tail

In [31]:
engine = create_engine("mysql://root:"+pw+"@13.209.5.42/test")

In [32]:
tips.to_sql("tips",engine, if_exists="replace")
# 파라미터중에 if_exists는 덮어쓰거나 붙이거나 등등 설정

# HeidiSQL 단축키 (그냥 내가 좋은걸로 바꾸는게 더 좋음 ㅋㅋ)

In [ ]:
# HeidiSQL단축키 설명
# 새창 열기	Ctrl + N	
# 새 쿼리 탭	Ctrl + T	
# 쿼리 탭 닫기	Ctrl + F4	
# 실행중인 작업취소	Esc	
# 이전 탭	Ctrl + Shift + Tab	이전 탭으로 이동
# 다음 탭	Ctrl + Tab	다음 탭으로 이동
# 실행	F9	쿼리탭의 전체 쿼리가 실행
# 선택 실행	Ctrl + F9	
# 현재 쿼리 실행	Ctrl + Shift + F9	
# 현재 쿼리의 실행 계획	Ctrl + F7	단축키 추가
# 다른이름으로 저장	F12	쿼리를 다른 이름으로 저장
# 선택 영역을 파일로 저장	Ctrl + Shift + S	
# 청소	Ctrl + W	쿼리편집기 내용 전부 지우기
# 내용 찾기	Ctrl + F	
# 내용 바꾸기	Ctrl + R	
# 다음 찾기 또는 바꾸기	F3	
# SQL 재구성	Ctrl + F8	더 읽기 쉽게 할 수 있도록 활성화된 편집기에서 어수선한 SQL을 자동으로 재구성
# 주석 설정/해제	Ctrl + F6	
# 데이터 결과 처음으로 이동	Ctrl + PgUp	단축키 추가
# 데이터 결과 마지막으로 이동	Ctrl + PgDn	단축키 추가
# 행 삽입	Ins	
# 행 복제후 삽입	Ctrl + Ins	
# 선택한 행을 삭제	Ctrl + Del	
# 적용	Ctrl + Enter	수정한 행을 update
# 다음	Ctrl + Alt + PgDn	
# 모두 보기	Ctrl + Alt + End	
# 이전 결과 탭	Alt + Left	
# 다음 결과 탭	Alt + Right

# 댓글서비스를 구현하기 위해서는?

In [ ]:
# 1. 파워풀한 서버 1개와 그 아래 테스크 분배하는 3개의 서버
# 2. Load balancing이라고 한다. 부하를 분담하는 시스템.
# 3. 데이터베이스 서버는 4개가 있었는데 masterDB에 insert가 쌓인다.
# 4. slaveDB에도 동기화가 되어서 master에서 자동으로 insert쿼리가 전송된다.
# 5. select쿼리는 slaveDB에서 처리했다. (마스터 슬레이브 관계로 부하를 나누는 데이터베이스 구조 -- 레플리케이션)
# 5-1. DB4는 request와 response에 대한 로그를 쌓는 데이터베이스였다. 이를통해 유의미한 정보를 분석하였다.
# 5-2. 물론 DB4도 내부에서는 여러 데이터베이스로 나뉜다.
# 6. DB5도 있었는데 이는 백업서버로 binary형태로 저장함. 스케줄링이 되어있어서 자동으로 적시가 되면 백업한다.
# 7. 백업DB는 꽉차면 가장 과거의 데이터베이스 백업정보를 삭제한다.